from Elements.downloaderImage import Download
from Elements.unifierJPG import Сombination
from Elements.cropJPG import cropJPG

print("""
███╗   ███╗  █████╗  ███╗   ██╗ ██████╗  ██████╗   ██████╗  ███████╗ ███████╗ ██╗              ██████╗ ██████╗   ██████╗ 
████╗ ████║ ██╔══██╗ ████╗  ██║ ██╔══██╗ ██╔══██╗ ██╔═══██╗ ██╔════╝ ██╔════╝ ██║                 ██╔╝ ██╔══██╗ ██╔════╝
██╔████╔██║ ███████║ ██╔██╗ ██║ ██████╔╝ ██████╔╝ ██║   ██║ █████╗   █████╗   ██║                 ██║  ██████╔╝ ██║  ███╗
██║╚██╔╝██║ ██╔══██║ ██║╚██╗██║ ██╔═══╝  ██╔██╔╝  ██║   ██║ ██╔══╝   ██╔══╝   ██║      ███╗ ██╗   ██║  ██╔═══╝  ██║   ██║
██║ ╚═╝ ██║ ██║  ██║ ██║ ╚████║ ██║      ██║ ██╗  ╚██████╔╝ ██║      ███████╗ ███████╗ ███║ ╚██████╔╝  ██║      ╚██████╔╝
╚═╝     ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚═══╝ ╚═╝      ╚═╝ ╚═╝   ╚═════╝  ╚═╝      ╚══════╝ ╚══════╝ ╚══╝  ╚═════╝   ╚═╝       ╚═════╝ 

""")

urlWebsite = input("Введите ссылку на последнюю картинку с мангой в главе.\nЕсли хотите больше чем одну главу, то вводите ссылку через запятую без пробелов.\n")
for i in urlWebsite.split(","):
    Download(i, "Detail/JPG/")

Сombination("Detail/JPG/", "Intermediate/output.jpg")

cropJPG(f"Intermediate/output.jpg", "Part")