from Elements.downloaderSite import Download
from Elements.unifierPNG import Сombination
from Elements.cropPNG import cropPNG

print("""
███╗   ███╗  █████╗  ███╗   ██╗ ██████╗  ██████╗   ██████╗  ███████╗ ███████╗ ██╗           ██████╗  ███╗   ██╗  ██████╗ 
████╗ ████║ ██╔══██╗ ████╗  ██║ ██╔══██╗ ██╔══██╗ ██╔═══██╗ ██╔════╝ ██╔════╝ ██║           ██╔══██╗ ████╗  ██║ ██╔════╝
██╔████╔██║ ███████║ ██╔██╗ ██║ ██████╔╝ ██████╔╝ ██║   ██║ █████╗   █████╗   ██║           ██████╔╝ ██╔██╗ ██║ ██║  ███╗
██║╚██╔╝██║ ██╔══██║ ██║╚██╗██║ ██╔═══╝  ██╔██╔╝  ██║   ██║ ██╔══╝   ██╔══╝   ██║      ███╗ ██╔═══╝  ██║╚██╗██║ ██║   ██║
██║ ╚═╝ ██║ ██║  ██║ ██║ ╚████║ ██║      ██║ ██╗  ╚██████╔╝ ██║      ███████╗ ███████╗ ███║ ██║      ██║ ╚████║ ╚██████╔╝
╚═╝     ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚═══╝ ╚═╝      ╚═╝ ╚═╝   ╚═════╝  ╚═╝      ╚══════╝ ╚══════╝ ╚══╝ ╚═╝      ╚═╝  ╚═══╝  ╚═════╝ 

""")

urlWebsite = input("Введите сылку на сайт с мангой: ")
chapter = int(input("Введите число последующих глав на скачивание: "))
Download(urlWebsite, "Detail/PNG/", chapter)

Сombination("Detail/PNG/", "Intermediate/output.png")

cropPNG(f"Intermediate/output.png", f"Part")